Airfoil/wingMotion/wingMotion2D_pimpleFoam/system/ensightWrite
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

ensightWrite
{
    type        ensightWrite;
    libs        (utilityFunctionObjects);
    log         true;

    fields      (U p);

    format      ascii;

    overwrite   true;

    writeControl writeTime;

    consecutive false;
}

// ************************************************************************* //
